---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition.OutsideOfDimensionLine
enum: Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition
source: html/2f710aa2-66b5-0995-1486-35482acd107e.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition.OutsideOfDimensionLine

The text will be positioned on the outside of the dimension line, where inside is represented by the bar curves.